Dlubal.RFEM5.MemberNonlinearityType
Type of member nonlinearity

Dlubal.RFEM5.MemberNonlinearityType.UnknownMemberNonlinearityType
Unknown nonlinearity type

Dlubal.RFEM5.MemberNonlinearityType.FailureTensionType
Failure under tension

Dlubal.RFEM5.MemberNonlinearityType.FailureCompressionType
Failure under compression

Dlubal.RFEM5.MemberNonlinearityType.FailureTensionSlippageType
Failure under tension with slippage

Dlubal.RFEM5.MemberNonlinearityType.FailureCompressionSlippageType
Failure under compression with slippage

Dlubal.RFEM5.MemberNonlinearityType.SlippageType
Slippage

Dlubal.RFEM5.MemberNonlinearityType.TearingTensionType
Tearing under tension

Dlubal.RFEM5.MemberNonlinearityType.YieldingTensionType
Yielding under tension

Dlubal.RFEM5.MemberNonlinearityType.TearingCompressionType
Tearing under compression

Dlubal.RFEM5.MemberNonlinearityType.YieldingCompressionType
Yielding under compression

Dlubal.RFEM5.MemberNonlinearityType.TearingType
Tearing

Dlubal.RFEM5.MemberNonlinearityType.YieldingType
Yielding

Dlubal.RFEM5.MemberNonlinearityType.MemberPlasticHingeType
Plastic hinge